Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetSelectedObjects Method
 Returns an enumerator of all the selected model objects in the model view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetSelectedObjects()
Public Function GetSelectedObjects As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator of all the selected model objects.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model.UI Namespace